/* ----------------------------------------------------*\
｜                       正则规则
\*---------------------------------------------------- */

// 动态手机号码正则表达式 无区号
export const phonePattern = (phoneType: string) => {
  switch (phoneType) {
    case '0': // 中国大陆
      return /^(1[3-9])\d{9}$/ // 11位数字，且以 13-19 开头
    case '1': // 中国香港
      return /^[6-9]\d{7}$/ // 8位数字，且以 6-9 开头
    case '2': // 中国澳门
      return /^[6-9]\d{7}$/ // 8位数字，且以 6-9 开头
    case '3': // 中国台湾
      return /^[0][9]\d{8}$/ // 10位数字，且以 09 开头
    default:
      return /^(1[3-9])\d{9}$/ // 默认是大陆号码格式
  }
}
